<?php
// Підключаємо конфігураційний файл для налаштування з'єднання з базою даних і старту сесії
require_once 'config/config.php';

// Перевіряємо наявність повідомлень у сесії (наприклад, про успішний вихід чи реєстрацію)
$message = '';
if (isset($_SESSION['message'])) {
  $message = $_SESSION['message'];
  unset($_SESSION['message']); // Видаляємо повідомлення після його відображення
}

// Перевіряємо, чи користувач авторизований
if (isset($_SESSION['user_id'])) {
  // Якщо користувач авторизований, перенаправляємо його на панель керування
  header('Location: views/dashboard.php');
  exit;
} else {
  // Якщо користувач не авторизований, перенаправляємо його на сторінку входу
  header('Location: public/login.php');
  exit;
}
?>
